# 重点内容：
# 1.算数运算符
# 2.比较运算符
# 3.赋值运算符
# 4.成员运算符
# 5.逻辑运算符
# 6.身份运算符

#.............算术运算符.................
# 1.+
# 2.-
# 3.*
# 4./
# 5.//
# 6.%  取余
# 7.**  幂
a=10
b=3
c=a%b
print(c)
print(a**2)

# ................比较运算符..................
# 1.==:比较左右两边的值是否相等
# 2.！=：比较左右两边的值是否不相等
# 3.>:比较左边的值是否大于右边的值
# 4.<:比较左边的值是否小于右边的值
# 5.>=:比较左边的值是否大于等于右边的值
# 6.<=:比较左边的值是否小于等于右边的值

# ...............赋值运算符..............
# 1.=:简单的赋值运算符  a=b+c 等效于将b+c的值赋值给a
# 2.+=:加法赋值运算符  a+=b  等效于a=a+b
# 3.-=:减法赋值运算符  a-=b  等效于a=a-b
# 4.*=:乘法赋值运算符  a*=b  等效于a=a*b
# 5./=:除法赋值运算符  a/=b  等效于a=a/b
# 6.%=:取余赋值运算符  a%=b  等效于a=a%b
# 7.**=:幂赋值运算符  a**=b  等效于a=a**b
# 8.//=:整除赋值运算符  a//=b  等效于a=a//b

# ...............逻辑运算符...................
# and (与) a and b  条件a和条件b同时成立的时候，结果是返回True,如果有一个不满足，结果则是返回False
# or (或) a or b 条件a和条件b满足一个结果是返回True,一个都不满足则是返回Flase
# nou 非 not a  条件a 如果是True,结果是返回False.条件不满足，结果是返回True

# .....................成员运算符...............
# 1.in     a  in   b    判断a是否在b中，不在是返回True,在返回False
# 2.not in a not in b   判断a是否不在b中，在是返回True,不在返回False

# ..............身份运算符.........
# 1.is a as b   判断a对象和b对象是否为同一对象，是结果返回True,不是结果返回False
# 2.is not a is not b  判断a对象和b对象是否为同一对象，不是结果返回True,是返回结果False